{
  "testimonials": [
    {
      "id": 1,
      "name": "Rahul Mehta",
      "title": "Software Engineer",
      "rating": 5,
      "content": "Very smooth experience from property visit to final registration. The team was transparent and guided me at every step."
    },
    {
      "id": 2,
      "name": "Priya Sharma",
      "title": "Doctor",
      "rating": 5,
      "content": "They helped me find a home in a safe locality with all amenities nearby. Documentation was handled professionally."
    },
    {
      "id": 3,
      "name": "Amit Verma",
      "title": "Business Owner",
      "rating": 5,
      "content": "Excellent market knowledge and genuine advice. They negotiated a great deal and saved me both time and money."
    },
    {
      "id": 4,
      "name": "Neha Patel",
      "title": "Interior Designer",
      "rating": 5,
      "content": "The team clearly understood my design preferences and suggested only relevant projects. Very honest and supportive."
    },
    {
      "id": 5,
      "name": "Arjun Nair",
      "title": "Financial Analyst",
      "rating": 5,
      "content": "Professional service with timely updates. Their property evaluation helped me make an informed investment decision."
    },
    {
      "id": 6,
      "name": "Ananya Iyer",
      "title": "Professor",
      "rating": 5,
      "content": "The process was stress free and well organized. All my queries were answered patiently. Truly trustworthy people."
    },
    {
      "id": 7,
      "name": "Rohit Singh",
      "title": "Consultant",
      "rating": 5,
      "content": "Found a great apartment within my budget. The team was courteous and handled paperwork end-to-end."
    },
    {
      "id": 8,
      "name": "Sanya Kapoor",
      "title": "Student",
      "rating": 5,
      "content": "Very friendly experience. Everything was explained clearly and there were no hidden charges. Highly recommended."
    },
    {
      "id": 9,
      "name": "Manish Gupta",
      "title": "Chartered Accountant",
      "rating": 5,
      "content": "They provided detailed legal and financial clarity before purchase. I felt confident throughout the transaction."
    },
    {
      "id": 10,
      "name": "Pooja Reddy",
      "title": "HR Manager",
      "rating": 5,
      "content": "I received excellent support in shortlisting projects near my office. Very responsive and professional team."
    },
    {
      "id": 11,
      "name": "Aditya Deshpande",
      "title": "Mechanical Engineer",
      "rating": 5,
      "content": "Their advice was practical and realistic. They didn’t oversell anything and focused on what suited my needs best."
    },
    {
      "id": 12,
      "name": "Kavya Menon",
      "title": "Architect",
      "rating": 5,
      "content": "Great eye for detail and project quality. They showed only reputed builders and verified properties."
    },
    {
      "id": 13,
      "name": "Vikram Malhotra",
      "title": "Hotelier",
      "rating": 5,
      "content": "The investment suggestions were spot on. Rental yield and appreciation potential were clearly explained."
    },
    {
      "id": 14,
      "name": "Shruti Jain",
      "title": "Lawyer",
      "rating": 5,
      "content": "All legal documentation was thoroughly checked and explained. The transparency of the team really impressed me."
    },
    {
      "id": 15,
      "name": "Karan Arora",
      "title": "Startup Founder",
      "rating": 5,
      "content": "Quick responses, professional conduct and deep knowledge of the market. A great partner for real estate needs."
    },
    {
      "id": 16,
      "name": "Meera Krishnan",
      "title": "Teacher",
      "rating": 5,
      "content": "Found my dream home within a week. They understood my requirement for schools and hospitals nearby."
    },
    {
      "id": 17,
      "name": "Nikhil Saxena",
      "title": "Bank Manager",
      "rating": 5,
      "content": "Loan assistance and registration were handled smoothly. I faced zero hassle during the entire process."
    },
    {
      "id": 18,
      "name": "Aisha Khan",
      "title": "Digital Marketer",
      "rating": 5,
      "content": "They showed modern properties with great amenities. Communication was clear and very professional."
    },
    {
      "id": 19,
      "name": "Harshad Kulkarni",
      "title": "Civil Engineer",
      "rating": 5,
      "content": "Strong technical understanding of construction quality and approvals. Their guidance was very valuable."
    },
    {
      "id": 20,
      "name": "Ritu Agarwal",
      "title": "Entrepreneur",
      "rating": 5,
      "content": "From the first call to key handover, the team was supportive and transparent. Truly a customer-centric company."
    }
  ]
}
